{
  "guild": {
    "id": "891103869097082901",
    "name": "Mr.King's RP Games",
    "iconUrl": "https://cdn.discordapp.com/icons/891103869097082901/a463d7b6979660de1a49b4eb3496507b.png"
  },
  "channel": {
    "id": "891387408619294722",
    "type": "GuildTextChat",
    "categoryId": "891383671892877402",
    "category": "World Of Darkness-The Scottish Holiday",
    "name": "session-summary",
    "topic": null
  },
  "dateRange": {
    "after": null,
    "before": null
  },
  "messages": [
    {
      "id": "892137787917213758",
      "type": "Default",
      "timestamp": "2021-09-27T19:57:03.758+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*9/24/2021*\n\nPlayers:  Ethan, Allison, Jack, Jeremiah, Grace. \nBackground knowledge was provided - The story is set in Scotland, in the highlands in the town of Inverness.  The vampire prince in Inverness is name Ian and has a history with Ethan's character.  The highlands are wild and are the home to werewolves and other creatures of the night - vampires stay close to home when they can help it.  There is a battlefield nearby called Culloden, where many Scotsmen died trying to take back their country over 200 years ago.  There is also a significant hill with standing stones nearby called Clava Cairns - these are host to a large group of mages who use them for their purposes.  \n\nThe group of vampires this story revolves around own a pub on the eastern outskirts of Inverness.  This acts as a small source of income for them, as well as a cover.  They have a haven underground, beneath the basement.  They try to keep the clientele to regulars, and few, when they can to avoid attracting notice. \n\nCharacter creation was started and will be completed at the next session.  An initial Scene will be begun at the next session.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "892138004565614623",
      "type": "Default",
      "timestamp": "2021-09-27T19:57:55.411+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "**Note**\nGrace left early and did not make her character.  We will not be holding the story for her.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "893655381081985076",
      "type": "Default",
      "timestamp": "2021-10-02T00:27:26.164+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*10/1/2021*\n\nPlayers: Allison, Jack, Ethan, Jeremiah\nCharacter creation was completed and context was given for various Vampire traits and procedures prior to play.  \n\nThe scene was set:  The eastern outskirts of Inverness, Scotland.  A pub, once owned by Becca's parents, now run by The Subway Gang as a cover for operations completed on behalf of Prince Ian.  The Gang has a haven beneath the basement of the pub. At a point in the past, they tried expanding the haven, only to end up connecting to an abandoned series of subway tunnels.  Their haven now includes these tunnels and a few abandoned subway cars.\n\nIt is late evening, after the sun has set.  The pub, about the size of Mr. King's classroom, is cozy with artificial lighting.  8-9 small tables and a medium bar contain a total of about 8 regulars, two small families, and 1 loud, boisterous newcomer.\n\nThe Gang plans to close early to make a scheduled pickup at a local distillery.  This is normal practice for them.  The scene begins with Max and Becca behind the bar, Zahir in a corner, avoiding people, and Moonshine in the basement.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "893656922027331584",
      "type": "Default",
      "timestamp": "2021-10-02T00:33:33.554+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "The loud man is described as appearing \"like a hippie biker.\"  He has been challenging people to arm wrestling competitions and winning money from them most of the evening.  Zahir seems stressed over this and Becca heads to help.  En route she is accosted by the man who challenges her to arm wrestle. She cannot refuse and sits down.\n\nMoonshine heads upstairs as Max heads to Zahir to make sure he's ok.  The latter two head to the basement to avoid the noise and pass Moonshine on the way.  Becca begins arm wrestling and seems to be holding her own.  The man is surprised.\n\nOn their way down the stairs, Zahir trips and falls, hurting himself.  Max and Zahir talk briefly.  Upstairs, things aren't going well for the biker.  Becca is humiliating him.  He alters his physiology somehow, strengthening his arm and pushing back mightily, but is no match for Becca who smashes his arm into the table, cracking it.\n\nMax hears the crack and, fearing for his tables, heads upstairs.  The man grabs Becca's arms and pulls her into a grapple.  Tense moments ensue as the Gang seem to be heading toward battle, but Max attempts to talk them down.  The man seems to be able to overcome his anger and steps back, as Becca manages to do the same.  He and Max have a staring match, then the man roars off on a motorcycle.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "893657978186653748",
      "type": "Default",
      "timestamp": "2021-10-02T00:37:45.362+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "Most of the people in the pub have left by now, with the notable exception of the four regulars at the bar, Lorna, Alastair, Lachlan, and Kenna.  Less than a minute later, the Gang hears loud pounding on the door.  At this, the four at the bar scoot out the back door.  The Gang hesitate and eventually the door is reduced to ash.  A tall, imposing man and a very small, young-looking woman enter.  They demand the help of the Gang, implying that \"your kind\" have stirred up trouble for them.  They provide a bit of a light show to prove they are serious.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "896576432443101225",
      "type": "Default",
      "timestamp": "2021-10-10T01:54:39.079+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*10/7/2021*\n\nPlayers: Jeremiah, Allison, Jack, Ethan\n\nThe Gang sat down with the mages in the pub for a \"chat\" (Max on the floor after being kicked there by the small female mage while groveling).  The gist of the situation was that they suspect a vampire has infiltrated the ranks of their magic school, but they are not equipped to either hunt or take down such a creature.  They left in a huff, essentially ordering the Gang to meet them at the school no later than dawn.\n\nThe Gang got themselves in order and decided that they needed to meet their supplier at the distillery before doing anything else.  The time was roughly 11:15pm.  The pickup was set for midnight.  They headed out, with Becca at the wheel.  After a couple of rough moments on some very rough roads, the passengers started to realize that they were being followed by *something*.  (Some of them noticed that 4 wolves were keeping pace with the vehicle, others just noticed something).  \n\nWhen the Gang came about even with the old Culloden Battlefield, Becca felt a large jolt and a bang.  She lost control of the vehicle and realized that a tire was blow.  They would have to stop. The backseat passengers (Moonshine and Zahir) remained in the truck while Max and Becca got out to take a look.  While Becca was leaned over inspecting the tire, Max got hit with an armor-piercing arrow in the shoulder that pinned him to the truck.  \n\nOver the course of about a minute and a half, Max proceeded to get two more arrows pinning him to the truck.  Becca, rounded the vehicle and tried to make a frantic call to the mages, but her phone also got hit with an arrow.  Both Moonshine and Zahir tried to help Max, but ended up staked with arrows and in torpor.  Throughout it all, the four wolves just sat in the fields, watching.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [
        {
          "emoji": {
            "id": "",
            "name": "👍",
            "isAnimated": false,
            "imageUrl": "https://twemoji.maxcdn.com/2/svg/1f44d.svg"
          },
          "count": 2
        }
      ],
      "mentions": []
    },
    {
      "id": "896577894711693352",
      "type": "Default",
      "timestamp": "2021-10-10T02:00:27.711+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "At this point, Max finally noticed their adversary.  A tall woman, dressed in a black hoodie and cutoff military fatigues strode toward him.  He managed to get some of the arrows out of himself before she approached him and held an arrow to his chest, hissing \"If you want to live, you'll come with us.\"  Max starts to recognize this person.  The shooting - no one shoots like that.  The walk, the voice - the shrouded face.  Could it be?\n\nThe wolves turn into people and guide the Gang back through the Battlefield to a camp in the woods beyond.  It is a mix of large campsite, trailer park, and Woodstock.  There are old RV's, campers, large tents and even lean-tos everywhere.  They even see a tree house or two.  The werewolves seem rowdy but also seem to care deeply for one another.  \n\nThey are led to an old 70's Winnebago, where they are able to tend to their friends and their wounds.  There they meet an old woman (werewolf?) with braided white hair who is butchering rabbits on the camper table.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "896578036319813673",
      "type": "Default",
      "timestamp": "2021-10-10T02:01:01.473+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*30-45 minutes pass before the next session.  Roleplay opportunities exist for those who want to take them*",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "898745299584057354",
      "type": "Default",
      "timestamp": "2021-10-16T01:32:57.301+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*10/8/2021 - 10/14/2021*\n\nPlayers: Jack, Max, Jeremiah, Allison\n\nVarious RP in the intermediate time via Discord in the RP rooms",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "898747759081951272",
      "type": "Default",
      "timestamp": "2021-10-16T01:42:43.691+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*10/15/2021*\n\nPlayers: Allison, Ethan, Jeremiah, Jack\n\nZahir, Max, and Allison are in a small clearing near Peregrine's tent.  She recently stalked off after threatening Zahir's life.  Zahir manages to get himself under control.  The other werewolves are heading to the Meet, so these three also head in that direction.  On the way, they run into a very distressed Moonshine.  The four of them enter the meeting tent.  \n\nInside, battery operated lanterns are arranged in a circle and werewolves are sitting around the outside.  Mother and Peregrine sit in the center.  Mother begins talking about their \"situation\" and how they've been attack 6 times in the last 2 months.  She says its time they struck at the source and mentions their \"guests.\"  She says that they have a connection to the source and will be able to help.\n\nPeregrine gives more details and calls out the other werewolves, saying that its time for everyone to stand up and fight, implying that her scouts are exhausted and can't fight alone anymore.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "898748320737009684",
      "type": "Default",
      "timestamp": "2021-10-16T01:44:57.6+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "Shortly afterward, Redtail bursts into the tent, announcing that three \"groups\" are attacking, one from the southwest one from the south, and one from the north.  The one from the north is led by a revenant.  Mother gathers two other werewolves and heads out.  The Gang follows Redtail and are themselves followed by Roaring Waters.  They head southwest and engage a horde of zombies who are already in battle with a large group of werwolves.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "898749206423044116",
      "type": "Default",
      "timestamp": "2021-10-16T01:48:28.764+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "The Gang can see that there are hundreds of these zombies.   The battle is close, and there are werewolf deaths.  Becca jumps in the fray quickly and Moonshine attacks. Max starts firing from the sidelines as the others learn that the zombies are vulnerable to headshots.\n\nPeregrine gets in a tight spot, surrounded and outnumbered.  She fights valiantly.  Zahir finds his inner strength and strides into the battle, single-handedly decapitating a zombie.  More keep coming.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "898749665682530405",
      "type": "Default",
      "timestamp": "2021-10-16T01:50:18.26+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "Eventually, Peregrine tactically retreats and approaches the group.  She asks them to leave and warn the vampires in town.  They mention that they do not have a vehicle and she tells them that Moonshine had stolen hers, and that they should just keep it.  They find her black and red 1969 Dodge Charger behind an RV, with Roaring Waters in the back seat.  He introduces himself to the group as Mighty Pines and the group roars off toward Inverness.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "899409882183254067",
      "type": "Default",
      "timestamp": "2021-10-17T21:33:46.14+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "Current timeline of events:",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "899409895030415432",
      "type": "Default",
      "timestamp": "2021-10-17T21:33:49.203+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "11:30 - Leave pub\n12:00 - Ambush\n12:45 - Arrive @ werewolf camp\n1:30 - Meet\n2:00 - Leave in Peregrine's car\n.\n.\n.\n7:30am - SUNRISE",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "908891066093162517",
      "type": "Default",
      "timestamp": "2021-11-13T01:28:36.536+00:00",
      "timestampEdited": "2021-11-13T01:41:26.361+00:00",
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*10/22/2021*\n\nPlayers:  Allison, Ethan, Jack, Jeremiah\n\nThe players decide to seek out Ian at his hotel room/ fortress.  During the approach, Max finds 3 envelopes in the glove box.  He reads them before getting out of the car.  Text below:\n\n**Keira Samuels orders:\nREPORT DATE: 9.1.2021\nLOCATION: 23 SAS Special Projects Team\nRAF Ayrshire/ Glasgow Prestwick Airport\nON LOAN from U.S. Green Berets\nORDERS: Counter-terrorism, Anti-hijacking, Counter-insurgency - sniper/ scout.\n(The special projects team is the official name for the Special Air Service anti-hijacking counter-terrorism team. It is trained in Close Quarter Battle (CQB), sniper techniques and specializes in hostage rescue in buildings or on public transport)\n\nSal Roberts Death Certificate:\n3.8.2022\nReport date: 3.11.2022\nCpt. Sal Roberts\nDied at 2315 3.8.2022\nMALE\n36 years 11 months 3 days\nCause of Death:  Murder\nAutopsy Report:  Severe Laceration, puncture wounds, loss of blood\nOfficial’s signature: Lt. Colonel Henry Fetters, RAF Heathrow\n\n1 addressed to:\n674125346 & 999065781\nCts. Samuels and Roberts\nDet. 2 RAF Ayrshire Box 2035 \nBFPO \nBF105\n0AX BFPO 15\nMISSING PERSONS REPORT\nMISSING PERSON: Major Valerie Porter\nFiled: 2.2.2022\nClosed: 2.16.2022\nPosted on: 2.17.2022\nLast seen: On Leave from the U.S.N.S Mercy in San Diego\nReported by: Commanding Officer Colonel Timika Lindsay\nInvestigating Officer: Sgt. Darren Foster (Chicago Police Department)\nReason for Closure: No evidence**\n\nThe team enters the hotel and has a *discussion* with some of Ian's thugs.  They find that Ian is at their pub.  They leave and head there.  They find the pub filled with Ian's cronies.  Ian is in the VIP room.   It turns out he had Dominated Moonshine.  He messes with Moonshine's mind.  He is paranoid about werewolves and mages.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "908891183365890079",
      "type": "Default",
      "timestamp": "2021-11-13T01:29:04.496+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "He is angry that the team worked with both without telling him or involving him.  He kicks them out of their pub and tells them that they are \"done.\"",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "908891412651712513",
      "type": "Default",
      "timestamp": "2021-11-13T01:29:59.162+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*10/29/2021-11/5/2021*\n\nPrequel episodes dedicated to strengthening the team.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "908894094682619934",
      "type": "Default",
      "timestamp": "2021-11-13T01:40:38.608+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*11/12/2021*\n\nPlayers: Jack, Ethan, Jeremiah, Allison (Blu on deck)\n\nThe characters convene around the 1969 Charger.  Brief discussion ensues and they head to Max's private apartment.  On the ride, Becca and Zahir notice that the car is riding strangely.  Becca pulls over and she and Max find a stash of black cases in a hidden compartment in the trunk.  While the two are outside, a text message arrives on a phone under the seat of the car.  Zahir finds it and gives it to Max.  It reads \"Keep the stash.  You'll do more good with it than I ever could.  Consider it a parting gift.  -P.\"  They continue to the apartment.  Once there, Moonshine calls his military equipment supplier.   The phone Max just got rings. \n Turns out, Peregrine was his supplier.  \n\nThe team heads into the apartment.  Once inside, Max is *insanely* forthcoming. They meet his cats, see his home, etc.  He sits them at the kitchen table and tells them everything, his whole story.  He tells them his plans - he wants to take Ian out, and replace him with them, with the team.  He asks them to commit, to tell their own stories and step into his plan. They all agree.  They then bring in the equipment and weapons from the car.  The team lives at the apartment for now.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "936797724790100010",
      "type": "Default",
      "timestamp": "2022-01-29T01:39:42.45+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "*Recap from Mid-Nov to 1/28*\n\nThe team assaulted the pub and was able to take Ian down.  Becca found an amazing new skill in the compound box and an ability to summon an inner strength she didn't know she had.  With a single shot, she staked him through the heart.  The team was able to clean up the rest of the vampires after that, with the help of Regina and one of her Valkyries, Alexandra (Lex).  \n\nAfter the assault, Regina surprises the team with a document naming the team plus Regina as regents of Inverness and the surrounding area.  They were also invited to a ball in London to celebrate.  The team cleans up and catches their breath.  \n\nThey make plans to travel to London via train.  They are going to stay with the Lord of London and the surrounding areas, Lord Voldaren (Regina's father).  At the ball, they meet and experience the leaders of various vampire sects (the Ordo Dracul, the Lancea Sanctum, and the Circle of the Crone).  Some members accepted membership into these organizations. \n\nThe team enjoys the ball and is honored for their heroics in taking down Ian. Ian in interred in a vault.  The team sleeps, and when they wake up, Regina confronts them with the news that Inverness and the surrounding area has been overrun with zombies.  They need to fly there immediately in the Voldaren's private helicopter, which the other Valkyrie Gail will fly. \n\nUpon arrival, the team speaks to Lex and HeOfManyNames in the pub.  They give them the run down and show them a map of the area showing where 4 different groups of zombies have taken over.  Each is led by a revenant with specific characteristics.  The team hot-wires a car and drives to the local village of Cradlehall (sans Zahir, who got attacked and saved by HeOfManyNames).",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "936798272394260480",
      "type": "Default",
      "timestamp": "2022-01-29T01:41:53.009+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "At Cradlehall, the team finds a village acting like nothing happened.  Becca goes into a pub and converses with the locals.  She learns that someone named \"Mother\" is protecting them.  The rest of the team get into a confrontation out front, and Max gets shot.  Moonshine attacks the man and the man dies, despite Becca's valiant efforts. The team rages against Moonshine, but before anything can happen, a group of people led by a glowing figure approach, hunting Moonshine and calling him \"The diablerist.\"  Moonshine breaks free of the group and heads to the people.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "936800928621801482",
      "type": "Default",
      "timestamp": "2022-01-29T01:52:26.303+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "@everyone Sorry I forgot to do this for so long. And sorry I kinda had to jam it all together. @LizardBoi Feel free to read through these to familiarize yourself.",
      "author": {
        "id": "294416680799567872",
        "name": "OnlyaJedi",
        "discriminator": "3499",
        "nickname": "OnlyaJedi",
        "color": "#E29E36",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/294416680799567872/99ab9f059e1aee9c2f699ab371821867.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": [
        {
          "id": "458245748195328001",
          "name": "LizardBoi",
          "discriminator": "3837",
          "nickname": "Antoni [Gabe]",
          "isBot": false
        }
      ]
    },
    {
      "id": "941771984713449482",
      "type": "Default",
      "timestamp": "2022-02-11T19:05:38.433+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": true,
      "content": "https://drive.google.com/drive/folders/1hpuzssLMWkalj55YssmZfYRsuQLTTG3l",
      "author": {
        "id": "570765952665387024",
        "name": "Max-A-Million",
        "discriminator": "8539",
        "nickname": "Louz [Maximilian]",
        "color": "#D80606",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/570765952665387024/cf3be31cf2e8c93bd0ff46927843e889.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": []
    },
    {
      "id": "941772004275658852",
      "type": "ChannelPinnedMessage",
      "timestamp": "2022-02-11T19:05:43.097+00:00",
      "timestampEdited": null,
      "callEndedTimestamp": null,
      "isPinned": false,
      "content": "Pinned a message.",
      "author": {
        "id": "570765952665387024",
        "name": "Max-A-Million",
        "discriminator": "8539",
        "nickname": "Louz [Maximilian]",
        "color": "#D80606",
        "isBot": false,
        "avatarUrl": "https://cdn.discordapp.com/avatars/570765952665387024/cf3be31cf2e8c93bd0ff46927843e889.png?size=512"
      },
      "attachments": [],
      "embeds": [],
      "stickers": [],
      "reactions": [],
      "mentions": [],
      "reference": {
        "messageId": "941771984713449482",
        "channelId": "891387408619294722",
        "guildId": null
      }
    }
  ],
  "messageCount": 24
}